tutorials/PFB_3D_Resolved_LES/PFB_3D_Resolved_LES/system/flowAve
functions
{
    // ============================================================
    // [预计算步骤]
    // ============================================================

    calcGradP
    {
        type            grad;
        libs            ("libfieldFunctionObjects.so");
        field           p;          
        result          gradP;      
	writeControl    runTime;
	writeInterval   0.02;
	executeControl  timeStep;  
        writeControl    none;       
    }

    calcDdtU
    {
        type            ddt;
        libs            ("libfieldFunctionObjects.so");
        field           U;
        result          ddtU;
	writeControl    runTime;
	writeInterval   0.02;
	executeControl  timeStep;      
        writeControl    none;
    }

    // ============================================================
    // [第一部分：自动化输出 U, gradP, ddtU]
    // ============================================================
    #codeStream
    {
        codeInclude
        #{
            #include <string>
        #};

        code
        #{
            os << endl; // 防止粘连

            int nx = 17;
            int nz = 6;

            for (int j = 1; j <= nz; ++j)
            {
                for (int i = 1; i <= nx; ++i)
                {
                    // ----------------------------------------
                    // 1. avgU
                    // ----------------------------------------
                    os << "    avgU_x" << i << "_z" << j << endl;
                    os << "    {" << endl;
                    os << "        type            volFieldValue;" << endl;
                    os << "        libs            (\"libfieldFunctionObjects.so\");" << endl;
                    os << "        log             true;" << endl;
		    os << "        writeControl    runTime;" << endl;
                    os << "        writeInterval   0.02;" << endl;
                    os << "        executeControl  timeStep;" << endl; 
                    os << "        writeFields     false;" << endl;
                    os << "        regionType      cellSet;" << endl;
                    os << "        operation       volAverage;" << endl;
                    os << "        name            x" << i << "_z" << j << ";" << endl;
                    os << "        fields          (U);" << endl;
                    os << "    }" << endl;
                    os << endl;

                    // ----------------------------------------
                    // 2. avgGradP
                    // ----------------------------------------
                    os << "    avgGradP_x" << i << "_z" << j << endl;
                    os << "    {" << endl;
                    os << "        type            volFieldValue;" << endl;
                    os << "        libs            (\"libfieldFunctionObjects.so\");" << endl;
                    os << "        log             true;" << endl;
		    os << "        writeControl    runTime;" << endl;
                    os << "        writeInterval   0.02;" << endl;
                    os << "        executeControl  timeStep;" << endl; 
                    os << "        writeFields     false;" << endl;
                    os << "        regionType      cellSet;" << endl;
                    os << "        operation       volAverage;" << endl;
                    os << "        name            x" << i << "_z" << j << ";" << endl;
                    os << "        fields          (gradP);" << endl;
                    os << "    }" << endl;
                    os << endl;

                    // ----------------------------------------
                    // 3. avgAcc (ddtU)
                    // ----------------------------------------
                    os << "    avgAcc_x" << i << "_z" << j << endl;
                    os << "    {" << endl;
                    os << "        type            volFieldValue;" << endl;
                    os << "        libs            (\"libfieldFunctionObjects.so\");" << endl;
                    os << "        log             true;" << endl;
		    os << "        writeControl    runTime;" << endl;
                    os << "        writeInterval   0.02;" << endl;
                    os << "        executeControl  timeStep;" << endl; 
                    os << "        writeFields     false;" << endl;
                    os << "        regionType      cellSet;" << endl;
                    os << "        operation       volAverage;" << endl;
                    os << "        name            x" << i << "_z" << j << ";" << endl;
                    os << "        fields          (ddtU);" << endl;
                    os << "    }" << endl;
                    os << endl;
                }
            }
        #};
    };

}
