tutorials/PFB_3D_Resolved_LES/PFB_3D_Resolved_LES/system/force
functions
{

    #codeStream
    {

        codeInclude
        #{
            #include <string>
        #};

        code
        #{
            os << endl;

            int nx = 17;
            int nz = 6;

            // ========================================================
            // 1. 生成汇总的 forces (forces_Total)
            // ========================================================
            os << "    forces_Total" << endl;
            os << "    {" << endl;
            os << "        type          forces;" << endl;
            os << "        libs          (\"libforces.so\");" << endl;
            os << "        writeControl  runTime;" << endl;
            os << "        writeInterval 0.02;" << endl;
            os << "        log           true;" << endl;
            os << "        rho           rhoInf;" << endl;
            os << "        rhoInf        1;" << endl;
            os << "        CofR          (0 0 0);" << endl;
            
            os << "        patches       (" << endl;
            for (int j = 1; j <= nz; ++j)
            {
                for (int i = 1; i <= nx; ++i)
                {
                    os << "            \"x" << i << "_z" << j << "\"" << endl;
                }
            }
            os << "        );" << endl; 
            os << "    }" << endl;
            os << endl; // 强制空行，分隔对象

            // ========================================================
            // 2. 生成单独的 forces (forces_xN_zM)
            // ========================================================
            for (int j = 1; j <= nz; ++j)
            {
                for (int i = 1; i <= nx; ++i)
                {
                    // 直接构造名称: forces_x1_z1
                    os << "    forces_x" << i << "_z" << j << endl;
                    os << "    {" << endl;
                    os << "        type          forces;" << endl;
                    os << "        libs          (\"libforces.so\");" << endl;
                    os << "        writeControl  runTime;" << endl;
                    os << "        writeInterval 0.02;" << endl;
                    os << "        log           true;" << endl;
                    os << "        rho           rhoInf;" << endl;
                    os << "        rhoInf        1;" << endl;
                    os << "        CofR          (0 0 0);" << endl;
                    
                    // patches ("x1_z1");
                    os << "        patches       (\"x" << i << "_z" << j << "\");" << endl;
                    
                    os << "    }" << endl;
                    os << endl; // 强制空行
                }
            }
        #};
    };
}
