tutorials/PFB_3D_Resolved_LES/PFB_3D_Resolved_LES/system/topoSetDict_A
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
\*---------------------------------------------------------------------------*/
FoamFile { version 2.0; format ascii; class dictionary; object topoSetDict; }
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
#codeStream
{
    code
    #{
        os << "(" << endl;

        // --- 参数设置 ---
        // X 方向 (1 到 17)
        int nx = 17;
        double xStart = -0.3025;
        double xStep = 0.037;

        // Z 方向 (1 到 6)
        int nz = 6;
        double zStart = 0.3305;
        double zStep = 0.037;

        // Y 方向 (固定)
        double yMin = 0.1115;
        double yMax = 0.1485;

        // --- 双重循环 ---
        for (int j = 1; j <= nz; ++j)
        {
            // 计算 Z 范围
            double curZmin = zStart + (j-1) * zStep;
            double curZmax = curZmin + zStep;

            for (int i = 1; i <= nx; ++i)
            {
                // 计算 X 范围
                double curXmin = xStart + (i-1) * xStep;
                double curXmax = curXmin + xStep;

                // 生成名称，例如: x1_z1
                
                // --- 动作 1: 创建集合 (boxToFace) ---
                os  << "    { "
                    << "name x" << i << "_z" << j << "; "
                    << "type faceSet; action new; "
                    << "source boxToFace; "
                    << "box (" << curXmin << " " << yMin << " " << curZmin << ") "
                    <<     "(" << curXmax << " " << yMax << " " << curZmax << "); "
                    << "}" << endl;

                // --- 动作 2: 取子集 (patchToFace - subset) ---
                os  << "    { "
                    << "name x" << i << "_z" << j << "; "
                    << "type faceSet; action subset; "
                    << "source patchToFace; patch floater; "
                    << "}" << endl;
            }
        }

        os << ");" << endl;
    #};
};

// ************************************************************************* //
